test/Lagrangian/tracer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

x0 -0.25;
x1 0.25;
y0 0;
y1 0.5;
halfThickness 0.025;
n 20;

vertices
(
    ($x0 $y0 #neg $halfThickness)
    ($x1 $y0 #neg $halfThickness)
    ($x1 $y1 #neg $halfThickness)
    ($x0 $y1 #neg $halfThickness)
    ($x0 $y0 $halfThickness)
    ($x1 $y0 $halfThickness)
    ($x1 $y1 $halfThickness)
    ($x0 $y1 $halfThickness)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($n $n 1) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
    name frontAndBack;
}

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (0 3 7 4)
            (1 2 6 5)
            (2 3 7 6)
        );
    }
);

// ************************************************************************* //
